VagrantBox/manuel.org
#+TITLE: Manuel de la Box Vagrant du MOOC BD
#+AUTHOR: Stéphane Germain, Olivier Berger
#+OPTIONS: html-link-use-abs-url:nil html-postamble:t
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+OPTIONS: num:2 timestamp:t
#+CREATOR: Copyright (C) 2014, The authors and Institut Mines-Télécom
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+LATEX_HEADER:
#+LANGUAGE: fr

* TL/DR;

*Pour le lecteur pressé, lire : [[./TLDR.html][Prise en main rapide de la Box Vagrant du MOOC BD Télécom SudParis]].*

* Introduction

** Environnement de travail virtualisé

Nous mettons à votre disposition un environnement de travail pour les
travaux pratiques / travail personnel (TPs) du MOOC Bases de Données
Relationnelles, basé sur une machine virtuelle.

L'objectif est de faire tourner, sur le poste de l'apprenant (/vous/), une
machine virtuelle contenant un serveur Linux dans lequel sont installés :

- un *serveur de base de donnée* (SGBDR) /PostgreSQL/ préconfiguré, dans
  lequel des bases de données d'exemples du cours ont été chargées.

- un serveur Web (Apache) permettant de fournir des applications Web
  locales utiles pour les TPs :

  - un "*exerciseur*" qui vous guidera dans l'apprentissage des requêtes
    SQL sur les bases de données d'exemples;

  - un outil professionnel de requêtage et d'administration des bases
    de données PostgreSQL : *phpPgAdmin*.

L'objectif est que vous soyez autonomes dans l'utilisation de cet
environnement installé en local sur votre ordinateur, y compris /sans
accès à internet/.

L'utilisation de Vagrant et VirtualBox pour faire tourner cet
environnement permet en théorie un même fonctionnement quelque soit
votre système d'exploitation Linux, MacOSX, Windows (à condition qu'il soit relativement
récent). Consultez cependant attentivement la section [[*Prérequis][Prérequis]].

** Compétences requises

Bien que cet environnement techniquement basé sur une machine virtuelle Linux, aucune
compétence en /administration système/ Unix ne devrait être nécessaire
pour pouvoir l'utiliser: l'interaction se déroulera principalement 
*dans l'interface Web* de votre navigateur, au moins pour les premiers TPs.

Cet environnement basé sur des logiciels libres est redistribuable, et
potentiellement réutilisable dans d'autre contextes, par exemple pour
votre utilisation professionelle, au-delà de ce MOOC (cf. [[*À propos de la Box Vagrant du MOOC][À propos de la Box Vagrant du MOOC]]).

** Avertissement

/Nous avons fait de notre mieux pour fournir un environnement fonctionnel, basé sur des logiciels libres, mais vous l'utilisez *à vos risques et périls, sans aucune garantie*. Nous ne pouvons être tenus responsables des dommages qui résulteraient de l'utilisation de cet environnement./

L'ensemble des sources de cet environnement sont disponibles en
logiciel libre sur XXX (sous licences XXX).

** Glossaire

- box :: paquetage d'installation d'une /machine virtuelle/
         préconfigurée, qui est pris en charge par l'application
         /Vagrant/. Les différentes versions des box sont publiées sur
         Internet (sur =https://vagrantcloud.com/=), afin de faciliter
         leur mise-à-jour.
- exerciseur :: application destinée à faciliter l'apprentissage
- guest :: voir /machine virtuelle/
- hôte :: votre machine, avec un système d'exploitation 64 bits, sur
          laquelle est installé le virtualiseur /VirtualBox/ utilisé par
          /Vagrant/ (c'est par exemple votre système /Windows 7/ habituel).
- machine virtuelle :: un système d'exploitation /virtualisé/ (ici un
     /Linux/ sur une machine fictive ayant 2.5 Go de disque et 256 Mo de
     RAM), qui est donc isolé des autres programmes de votre système
     /hôte/. Nous l'avons préinstallé avec différents
     logiciels. VirtualBox et Vagrant font fonctionner cette machine virtuelle:
     démarrage, arrêt, mise en pause, etc.
- VM :: /Virtual Machine/ voir /machine virtuelle/

* Installation

** Prérequis

- Disposer d'une machine moderne avec un système d'exploitation 64
  bits sur lequel VirtualBox\trade fonctionne[fn:2]

- Avoir un environnement internet à haut débit, le temps de télécharger l'environnement[fn:4]

- Avoir au moins 2 Go de libre sur un disque dur local

- Maîtriser un minimum l'utilisation d'un système d'exploitation,
  notamment en mode invite de commande (commandes de base DOS ou shell
  Unix, type =cd=, =ls/dir=, etc.).

** Télécharger et installer Vagrant et VirtualBox

Téléchargez les deux applications depuis leurs sites, ou installez les
paquetages pour votre distribution (si vous êtes sur Linux).

- Vagrant : http://www.vagrantup.com/downloads.html
- VirtualBox : https://www.virtualbox.org/wiki/Downloads


