VagrantBox/manuel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<title>Manuel de la Box Vagrant du MOOC BD</title>
<!-- 2014-08-14 jeu. 10:18 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Stéphane Germain, Olivier Berger" />
</head>
<body>
<div id="content">
<h1 class="title">Manuel de la Box Vagrant du MOOC BD</h1>
<div id="table-of-contents">
<h2>Table des matières</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. TL/DR;</a></li>
<li><a href="#sec-2">2. Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1. Environnement de travail virtualisé</a></li>
<li><a href="#sec-2-2">2.2. Compétences requises</a></li>
<li><a href="#sec-2-3">2.3. Avertissement</a></li>
<li><a href="#sec-2-4">2.4. Glossaire</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Installation</a>
<ul>
<li><a href="#sec-3-1">3.1. Prérequis</a></li>
<li><a href="#sec-3-2">3.2. Télécharger et installer Vagrant et VirtualBox</a></li>
<li><a href="#sec-3-3">3.3. Initialisation et mise en route</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Utilisation</a>
<ul>
<li><a href="#sec-4-1">4.1. Lancement de la machine virtuelle</a></li>
<li><a href="#sec-4-2">4.2. Accès aux applications pour les TPs</a>
<ul>
<li><a href="#sec-4-2-1">Exerciseur de requêtes SQL</a></li>
<li><a href="#sec-4-2-2">Module Web d'administration PostgreSQL <i>phpPgAdmin</i></a></li>
<li><a href="#sec-4-2-3">En ligne de commande PostgreSQL</a></li>
<li><a href="#sec-4-2-4">Faire des mises à jour dans la base de données</a></li>
<li><a href="#sec-4-2-5"><span class="todo TODO">TODO</span> Programmation Web / BD en PHP</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. FAQ</a>
<ul>
<li><a href="#sec-5-1">5.1. <span class="todo TODO">TODO</span> Si je n'ai que VirtualBox, puis-je me passer de l'installation de Vagrant ?</a>
<ul>
<li><a href="#sec-5-1-1">Je n'arrive pas à me connecter depuis la console affichée par VirtualBox</a></li>
<li><a href="#sec-5-1-2">Comment installer un environnement de bureau sur la VM</a></li>
<li><a href="#sec-5-1-3"><span class="todo TODO">TODO</span> Comment installer l'application exerciseur manuellement</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. J'ai un système 32 bits, est-ce que ça marchera pour moi ?</a></li>
<li><a href="#sec-5-3">5.3. Je n'ai pas accès à Internet en haut débit</a></li>
<li><a href="#sec-5-4">5.4. Le message de confirmation de mise en place ne s'affiche pas.</a></li>
<li><a href="#sec-5-5">5.5. Quand j'utilise la commande <code>vagrant up</code>, je vois de nombreuses lignes "default: Warning: Connection timeout. Retrying&#x2026;" ou "default: Warning: Remote connection disconnect. Retrying&#x2026;"</a></li>
<li><a href="#sec-5-6">5.6. <span class="todo TODO">TODO</span> Si le binding de port ne fonctionne pas, que faire (rerédiger en fonction du message d'erreur réel)</a></li>
<li><a href="#sec-5-7">5.7. <code>vagrant ssh</code> échoue, sous Windows</a></li>
<li><a href="#sec-5-8">5.8. Comment me connecter via SSH à la VM vagrant</a></li>
<li><a href="#sec-5-9">5.9. <span class="todo TODO">TODO</span> J'ai écrasé la base de données, que faire</a></li>
<li><a href="#sec-5-10">5.10. Si j'ai déjà un autre virtualiseur, puis-je convertir la VM ?</a></li>
</ul>
</li>
<li><a href="#sec-6">6. À propos de la Box Vagrant du MOOC</a>
<ul>
<li><a href="#sec-6-1">6.1. Architecture technique</a></li>
<li><a href="#sec-6-2">6.2. Utilité dans des contextes différents</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Copyright</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> TL/DR;</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>Pour le lecteur pressé, lire : <a href="./TLDR.html">Prise en main rapide de la Box Vagrant du MOOC BD Télécom SudParis</a>.</b>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Environnement de travail virtualisé</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Nous mettons à votre disposition un environnement de travail pour les
travaux pratiques / travail personnel (TPs) du MOOC Bases de Données
Relationnelles, basé sur une machine virtuelle.
</p>

<p>
L'objectif est de faire tourner, sur le poste de l'apprenant (<i>vous</i>), une
machine virtuelle contenant un serveur Linux dans lequel sont installés :
</p>

<ul class="org-ul">
<li>un <b>serveur de base de donnée</b> (SGBDR) <i>PostgreSQL</i> préconfiguré, dans
lequel des bases de données d'exemples du cours ont été chargées.
</li>

<li>un serveur Web (Apache) permettant de fournir des applications Web
locales utiles pour les TPs :

<ul class="org-ul">
<li>un "<b>exerciseur</b>" qui vous guidera dans l'apprentissage des requêtes
SQL sur les bases de données d'exemples;
</li>

<li>un outil professionnel de requêtage et d'administration des bases
de données PostgreSQL : <b>phpPgAdmin</b>.
</li>
</ul>
</li>
</ul>

<p>
L'objectif est que vous soyez autonomes dans l'utilisation de cet
environnement installé en local sur votre ordinateur, y compris <i>sans
accès à internet</i>.
</p>

<p>
L'utilisation de Vagrant et VirtualBox pour faire tourner cet
environnement permet en théorie un même fonctionnement quelque soit
votre système d'exploitation Linux, MacOSX, Windows (à condition qu'il soit relativement
récent). Consultez cependant attentivement la section <a href="#sec-3-1">Prérequis</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Compétences requises</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Bien que cet environnement techniquement basé sur une machine virtuelle Linux, aucune
compétence en <i>administration système</i> Unix ne devrait être nécessaire
pour pouvoir l'utiliser: l'interaction se déroulera principalement 
<b>dans l'interface Web</b> de votre navigateur, au moins pour les premiers TPs.
</p>

<p>
Cet environnement basé sur des logiciels libres est redistribuable, et
potentiellement réutilisable dans d'autre contextes, par exemple pour
votre utilisation professionelle, au-delà de ce MOOC (cf. <a href="#sec-6">À propos de la Box Vagrant du MOOC</a>).
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Avertissement</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<i>Nous avons fait de notre mieux pour fournir un environnement fonctionnel, basé sur des logiciels libres, mais vous l'utilisez <b>à vos risques et périls, sans aucune garantie</b>. Nous ne pouvons être tenus responsables des dommages qui résulteraient de l'utilisation de cet environnement.</i>
</p>

<p>
L'ensemble des sources de cet environnement sont disponibles en
logiciel libre sur XXX (sous licences XXX).
</p>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Glossaire</h3>
<div class="outline-text-3" id="text-2-4">
<dl class="org-dl">
<dt> box </dt><dd>paquetage d'installation d'une <i>machine virtuelle</i>
préconfigurée, qui est pris en charge par l'application
<i>Vagrant</i>. Les différentes versions des box sont publiées sur
Internet (sur <code>https://vagrantcloud.com/</code>), afin de faciliter
leur mise-à-jour.
</dd>
<dt> exerciseur </dt><dd>application destinée à faciliter l'apprentissage
</dd>
<dt> guest </dt><dd>voir <i>machine virtuelle</i>
</dd>
<dt> hôte </dt><dd>votre machine, avec un système d'exploitation, sur
laquelle est installé le virtualiseur <i>VirtualBox</i> utilisé par
<i>Vagrant</i> (c'est par exemple votre système <i>Windows 7</i> habituel).
</dd>
<dt> machine virtuelle </dt><dd>un système d'exploitation <i>virtualisé</i> (ici un
<i>Linux</i> sur une machine fictive ayant 2.5 Go de disque et 256 Mo de
RAM), qui est donc isolé des autres programmes de votre système
<i>hôte</i>. Nous l'avons préinstallé avec différents
logiciels. VirtualBox et Vagrant font fonctionner cette machine virtuelle:
démarrage, arrêt, mise en pause, etc.
</dd>
<dt> VM </dt><dd><i>Virtual Machine</i> voir <i>machine virtuelle</i>
</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Installation</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Prérequis</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Disposer d'une machine moderne avec un système d'exploitation 64
bits (ou 32 bits<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>) sur lequel VirtualBox&trade; fonctionne<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>
</li>

<li>Avoir un environnement internet à haut débit, le temps de télécharger l'environnement<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>
</li>

<li>Avoir au moins 2 Go de libre sur un disque dur local
</li>

<li>Maîtriser un minimum l'utilisation d'un système d'exploitation,
notamment en mode invite de commande (commandes de base DOS ou shell
Unix, type <code>cd</code>, <code>ls/dir</code>, etc.).
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Télécharger et installer Vagrant et VirtualBox</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Téléchargez les deux applications depuis leurs sites, ou installez les
paquetages pour votre distribution (si vous êtes sur Linux).
</p>

<ul class="org-ul">
<li>Vagrant : <a href="http://www.vagrantup.com/downloads.html">http://www.vagrantup.com/downloads.html</a>
</li>
<li>VirtualBox : <a href="https://www.virtualbox.org/wiki/Downloads">https://www.virtualbox.org/wiki/Downloads</a>
</li>
</ul>
</div>
</div>
