VagrantBox/manuel.org
** Initialisation et mise en route

Choisir un dossier de travail dans lequel Vagrant va installer une
*machine virtuelle* 64 bits, et où les fichiers des TPs vont résider. Ce dossier
doit être choisi sur une partition disposant d'au moins 2 Go d'espace de
stockage libre.


# La machine virtuelle prête à l'emploi est sur vagrantcloud

Pour télécharger la /box/ Vagrant et procéder au premier lancement de de la /machine virtuelle/, suivre les étapes suivantes :

1. ouvrir un invite de commande[fn:3] dans le dossier de travail choisi (utiliser =cd= pour s'y positionner):

2. entrer la commande suivante : 
   #+BEGIN_example
   vagrant init oberger/moocbdvm
   #+END_EXAMPLE
   un fichier =Vagrantfile= est créé dans le dossier de travail;

3. entrer la commande suivante :
   #+BEGIN_example
   vagrant up
   #+END_EXAMPLE
   ceci va télécharger la dernière version de la [[https://vagrantcloud.com/oberger/moocbdvm][/box/ =oberger/moocbdvm=]] depuis Internet
   (env. 500 Mo), et démarrer une machine virtuelle VirtualBox
   en tâche de fond, qui fournira l'environnement Web que vous allez utiliser.

*ATTENTION: La mise en place peut être longue et prendre du temps sur les machines peu puissantes et/ou ne disposant pas d'une connexion internet haut-débit.*

La mise en place est terminée quand s'affiche la ligne "/Successfully created the virtual machine./". Si tout va bien, la machine virtuelle
est visible dans l'interface d'administration de VirtualBox (et peut
être démarrée, arrêtée, ou mise en pause comme une machine virtuelle
ordinaire).

Pour une explication des commandes de base de Vagrant,
consultez
[[http://docs.vagrantup.com/v2/getting-started/index.html][le guide de démarrage vagrant (en anglais)]].

* Utilisation

La machine virtuelle doit être lancée, en tâche de fond, pour pouvoir
utiliser l'environnement de travail personnel du MOOC. 

** Lancement de la machine virtuelle

1. ouvrir un invite de commande dans le dossier de travail;

2. entrer la commande:
   #+BEGIN_example
   vagrant up
   #+END_example
   la mise en place de la machine est finie quand s'affiche la ligne "...". Si la machine virtuelle était déjà lancée, rien ne se passe, tant mieux.

Une fois lancée, elle fournit un serveur HTTP qui est redirigé sur
l'adresse locale de l'ordinateur /hôte/ =localhost= (=127.0.0.1=), qui
écoute sur le port =8080= (d'où les URLs ci-dessous commençant par =http://localhost:8080/=).

** Accès aux applications pour les TPs

*** Exerciseur de requêtes SQL

Une fois la machine virtuelle lancée, ouvrir un navigateur Web et aller sur http://localhost:8080/bdsqlwiz/appli/

Vous pouvez maintenant commencer votre apprentissage du langage SQL !

*** Module Web d'administration PostgreSQL /phpPgAdmin/

- Connectez votre navigateur à l'adresse :
  http://localhost:8080/phppgadmin/

- Connectez-vous au /Serveur/ =PostgreSQL= :

  - User : =pg_reader=

  - Password : =tpinfint=

Vous pouvez désormais saisir des requêtes SQL (de consultation seulement) sur le serveur PostgreSQL.

*** En ligne de commande PostgreSQL

Pour exécuter des commandes SQL sur le serveur PostgreSQL présent à l'interieur de la machine virtuelle, procéder comme suit :

1. connectez-vous dans la machine virtuelle dans le compte =vagrant=
   #+BEGIN_example
   vagrant ssh
   #+END_example
   vous devriez alors voir le /prompt/ du shell Linux (si un client SSH est disponible \--- Cf. [[*=vagrant ssh= échoue, sous Windows][FAQ]]), quelque chose du style :
   #+BEGIN_example
   Linux localhost 3.14-2-amd64 #1 SMP Debian 3.14.13-2 (2014-07-24) x86_64
   
   The programs included with the Debian GNU/Linux system are free software;
   the exact distribution terms for each program are described in the
   individual files in /usr/share/doc/*/copyright.
   
   Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent
   permitted by applicable law.
   Last login: Wed Aug 13 13:27:54 2014 from 10.0.2.2
   vagrant@localhost:~$
   #+END_example

2. lancez la commande de connexion à PostgreSQL en ligne de commande (connexion à la base =vins= en tant qu'utilisateur PostgreSQL =pg_reader= :
   #+BEGIN_example
   psql -U pg_reader vins
   #+END_example
   vous devriez alors voir le /prompt/ de l'interface ligne de commandes de PostgreSQL.
   #+BEGIN_example
   psql (9.4beta2)
   Saisissez « help » pour l'aide.
   
   vins=>
   #+END_example

*** Faire des mises à jour dans la base de données

Utilisez l'application Web /phppgadmin/ (voir [[*Module Web d'administration PostgreSQL /phpPgAdmin/][ci-dessus]]), avec l'utilisateur =postgres=,
l'administrateur PostgreSQL qui a tous les droits sur la base de
données. Son mot-de-passe est aussi =postgres=.

Bien entendu, tout est possible quand on est administrateur, donc
attention avant de tout casser.

*** TODO Programmation Web / BD en PHP

Un sous-répertoire "=TP/=" est créé dans le répertoire dans lequel
vous avez lancé la création de la machine virtuelle.

Vous pouvez faire un =git pull= dans ce répertoire.

Le résultat est accessible sur http://localhost:8080/TP/

* FAQ

# ** TODO Quels sont les prérequis

# - un espace disque disponible de (TODO) :
#   - 350 Mo pour DebianBox.box
# TBD

** TODO Si je n'ai que VirtualBox, puis-je me passer de l'installation de Vagrant ?

Il est possible de télécharger une /box/ Vagrant (fichier =.box=) et
d'en extraire le contenu (c'est en réalité une archive /tar/
compressée, équivalente à un =.tgz= / =.tar.gz=). Par exemple, sous
Unix : =tar zxf package.box=.


On peut en extraire un fichier de définition de machine virtuelle
VirtualBox (=./box.ovf=), ainsi que le fichier d'image de disque
(=./box-disk1.vmdk=) correspondant.

Il est alors possible d'importer le tout dans VirtualBox, et de
redéfinir les redirections de ports appropriées, ou les partages de
dossiers, etc.

*** Je n'arrive pas à me connecter depuis la console affichée par VirtualBox

Attention : le clavier configuré par défaut, pour la console de login
affichée par VirtualBox est en disposition *azerty* (comme rappelé par
le message d'accueil affiché avant le prompt de /login/).

Une alternative à l'utilisation de la console affichée par VirtualBox,
est d'utiliser =vagrant ssh=, qui fonctionnera en principe quelque
soit votre disposition de clavier.

