VagrantBox/manuel.html


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Initialisation et mise en route</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Choisir un dossier de travail dans lequel Vagrant va installer une
<b>machine virtuelle</b>, et où les fichiers des TPs vont résider. Ce dossier
doit être choisi sur une partition disposant d'au moins 2 Go d'espace de
stockage libre.
</p>


<p>
Pour télécharger la <i>box</i> Vagrant et procéder au premier lancement de de la <i>machine virtuelle</i>, suivre les étapes suivantes :
</p>

<ol class="org-ol">
<li>ouvrir un invite de commande<sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup> dans le dossier de travail choisi (utiliser <code>cd</code> pour s'y positionner):
</li>

<li>entrer la commande suivante : 
<pre class="example">
vagrant init oberger/moocbdvm
</pre>
<p>
un fichier <code>Vagrantfile</code> est créé dans le dossier de travail;
</p>
</li>

<li>entrer la commande suivante :
<pre class="example">
vagrant up
</pre>
<p>
ceci va télécharger la dernière version de la <a href="https://vagrantcloud.com/oberger/moocbdvm"><i>box</i> <code>oberger/moocbdvm</code></a> depuis Internet
(env. 350 Mo), et démarrer une machine virtuelle VirtualBox
en tâche de fond, qui fournira l'environnement Web que vous allez utiliser.
</p>
</li>
</ol>

<p>
<b>ATTENTION: La mise en place peut être longue et prendre du temps sur les machines peu puissantes et/ou ne disposant pas d'une connexion internet haut-débit.</b>
</p>

<p>
La mise en place est terminée quand s'affiche la ligne "<i>Successfully created the virtual machine.</i>". Si tout va bien, la machine virtuelle
est visible dans l'interface d'administration de VirtualBox (et peut
être démarrée, arrêtée, ou mise en pause comme une machine virtuelle
ordinaire).
</p>

<p>
Pour une explication des commandes de base de Vagrant,
consultez
<a href="http://docs.vagrantup.com/v2/getting-started/index.html">le guide de démarrage vagrant (en anglais)</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Utilisation</h2>
<div class="outline-text-2" id="text-4">
<p>
La machine virtuelle doit être lancée, en tâche de fond, pour pouvoir
utiliser l'environnement de travail personnel du MOOC. 
</p>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Lancement de la machine virtuelle</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>ouvrir un invite de commande dans le dossier de travail;
</li>

<li>entrer la commande:
<pre class="example">
vagrant up
</pre>
<p>
la mise en place de la machine est finie quand s'affiche la ligne "&#x2026;". Si la machine virtuelle était déjà lancée, rien ne se passe, tant mieux.
</p>
</li>
</ol>

<p>
Une fois lancée, elle fournit un serveur HTTP qui est redirigé sur
l'adresse locale de l'ordinateur <i>hôte</i> <code>localhost</code> (<code>127.0.0.1</code>), qui
écoute sur le port <code>8080</code> (d'où les URLs ci-dessous commençant par <code>http://localhost:8080/</code>).
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Accès aux applications pour les TPs</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1">Exerciseur de requêtes SQL</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Une fois la machine virtuelle lancée, ouvrir un navigateur Web et aller sur <a href="http://localhost:8080/bdsqlwiz/appli/">http://localhost:8080/bdsqlwiz/appli/</a>
</p>

<p>
Vous pouvez maintenant commencer votre apprentissage du langage SQL !
</p>
</div>
</div>

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2">Module Web d'administration PostgreSQL <i>phpPgAdmin</i></h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li>Connectez votre navigateur à l'adresse :
<a href="http://localhost:8080/phppgadmin/">http://localhost:8080/phppgadmin/</a>
</li>

<li>Connectez-vous au <i>Serveur</i> <code>PostgreSQL</code> :

<ul class="org-ul">
<li>User : <code>pg_reader</code>
</li>

<li>Password : <code>tpinfint</code>
</li>
</ul>
</li>
</ul>

<p>
Vous pouvez désormais saisir des requêtes SQL (de consultation seulement) sur le serveur PostgreSQL.
</p>
</div>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3">En ligne de commande PostgreSQL</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Pour exécuter des commandes SQL sur le serveur PostgreSQL présent à l'interieur de la machine virtuelle, procéder comme suit :
</p>

<ol class="org-ol">
<li>connectez-vous dans la machine virtuelle dans le compte <code>vagrant</code>
<pre class="example">
vagrant ssh
</pre>
<p>
vous devriez alors voir le <i>prompt</i> du shell Linux (si un client SSH est disponible &#x00ad;&#x2013; Cf. <a href="#sec-5-7">FAQ</a>), quelque chose du style :
</p>
<pre class="example">
Linux localhost 3.14-2-amd64 #1 SMP Debian 3.14.13-2 (2014-07-24) x86_64

The programs included with the Debian GNU/Linux system are free software;
the exact distribution terms for each program are described in the
individual files in /usr/share/doc/*/copyright.

Debian GNU/Linux comes with ABSOLUTELY NO WARRANTY, to the extent
permitted by applicable law.
Last login: Wed Aug 13 13:27:54 2014 from 10.0.2.2
vagrant@localhost:~$
</pre>
</li>

<li>lancez la commande de connexion à PostgreSQL en ligne de commande (connexion à la base <code>vins</code> en tant qu'utilisateur PostgreSQL <code>pg_reader</code> :
<pre class="example">
psql -U pg_reader vins
</pre>
<p>
vous devriez alors voir le <i>prompt</i> de l'interface ligne de commandes de PostgreSQL.
</p>
<pre class="example">
psql (9.4beta2)
Saisissez « help » pour l'aide.

vins=&gt;
</pre>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4">Faire des mises à jour dans la base de données</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Utilisez l'application Web <i>phppgadmin</i> (voir <a href="#sec-4-2-2">ci-dessus</a>), avec l'utilisateur <code>postgres</code>,
l'administrateur PostgreSQL qui a tous les droits sur la base de
données. Son mot-de-passe est aussi <code>postgres</code>.
</p>

<p>
Bien entendu, tout est possible quand on est administrateur, donc
attention avant de tout casser.
</p>
</div>
</div>

<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="todo TODO">TODO</span> Programmation Web / BD en PHP</h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
Un sous-répertoire "<code>TP/</code>" est créé dans le répertoire dans lequel
vous avez lancé la création de la machine virtuelle.
</p>

<p>
Vous pouvez faire un <code>git pull</code> dans ce répertoire.
</p>

<p>
Le résultat est accessible sur <a href="http://localhost:8080/TP/">http://localhost:8080/TP/</a>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> FAQ</h2>
<div class="outline-text-2" id="text-5">
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Si je n'ai que VirtualBox, puis-je me passer de l'installation de Vagrant ?</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Il est possible de télécharger une <i>box</i> Vagrant (fichier <code>.box</code>) et
d'en extraire le contenu (c'est en réalité une archive <i>tar</i>
compressée, équivalente à un <code>.tgz</code> / <code>.tar.gz</code>). Par exemple, sous
Unix : <code>tar zxf package.box</code>.
</p>


<p>
On peut en extraire un fichier de définition de machine virtuelle
VirtualBox (<code>./box.ovf</code>), ainsi que le fichier d'image de disque
(<code>./box-disk1.vmdk</code>) correspondant.
</p>

<p>
Il est alors possible d'importer le tout dans VirtualBox, et de
redéfinir les redirections de ports appropriées, ou les partages de
dossiers, etc.
</p>
</div>

<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">Je n'arrive pas à me connecter depuis la console affichée par VirtualBox</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
Attention : le clavier configuré par défaut, pour la console de login
affichée par VirtualBox est en disposition <b>azerty</b> (comme rappelé par
le message d'accueil affiché avant le prompt de <i>login</i>).
</p>

<p>
Une alternative à l'utilisation de la console affichée par VirtualBox,
est d'utiliser <code>vagrant ssh</code>, qui fonctionnera en principe quelque
soit votre disposition de clavier.
</p>
</div>
</div>
