VagrantBox/manuel.org
*** Comment installer un environnement de bureau sur la VM

Normalement, vous n'aurez pas besoin d'utiliser la machine virtuelle en mode bureau graphique pour les TPs du MOOC, mais c'est cependant tout-à-fait faisable.

Nous fournissons un script de mise-à-jour permettant d'installer (en
mode superutilisateur Linux) l'environnement de bureau XFCE4,
préconfiguré en français avec clavier azerty : =/usr/local/sbin/install-gui.sh=.

Pour le lancer, rentrer la commande suivante :
#+BEGIN_example
vagrant ssh -c "sudo /usr/local/sbin/install-gui.sh"
#+END_example

Attention, ceci fait augmenter substentiellement l'occupation disque de la machine virtuelle.

*** TODO Comment installer l'application exerciseur manuellement

Les sources sont disponibles depuis git avec : 
git clone http://fusionforge.int-evry.fr/anonscm/git/bdsqlwiz/bdsqlwiz.git

TBD : archive extractible .zip, dans
https://fusionforge.int-evry.fr/frs/?group_id=64

** J'ai un système 32 bits, est-ce que ça marchera pour moi ?

Nous ne fournissons pour l'instant aucun environnement de machine
virtuelle 32 bits. Vous devrez avoir un système d'exploitation 64 bits
sur l'hôte pour utiliser notre /box/ 64 bits.

** Je n'ai pas accès à Internet en haut débit

C'est bien dommage (d'autant que visionner les vidéos du MOOC doit
être pénible, dans ce cas). Cependant, vous pouvez installer de façon
indépendantes, les applications que nous avons empaquetées dans la
/box/.

Notez tout d'abord qu'un environnement d'exerciseur est disponible
aussi pour les navigateurs basés sur Webkit (Chrome, Safari), sans
nécessiter l'installation d'un SGBD comme PostgreSQL. (Cf. XXX - TODO)

Autrement, pas besoin de machine virtuelle, si vous savez installer un
SGBD par vous-même. Si vous avez la possibilité de créer une base de
données PostgreSQL localement, les scripts de création de base sont
disponibles dans XXX TODO.

# ** Il y a plein de messages en verts et rouge quand j'entre la commande =vagrant up= !

# Ce comportement est tout à fait normal et correspond à l'installation des différents composants utiles pour l'apprentissage du SQL.

** Le message de confirmation de mise en place ne s'affiche pas.

Reprendre les instuctions d'installation depuis le début en vérifiant que toutes les étapes ont été correctement suivies.

# Vérifier notamment que le BoxMOOCSQL est bien orthographié lors de l'utilisation de la commande.

# Se reporter au site du tp pour vérifier que le DebianBox.box et le Vagrantfile sont bien à jour tous les deux. Le cas échéant, télécharger les nouveaux DebianBox.box et Vagrantfile et recommencer l'installation.

Il peut être nécessaire de mettre à jour la box (commandes =vagrant box outdated=, etc.). Veuillez vous reporter à la documentation Vagrant.

Si le problème persiste, contactez-nous via les forums du MOOC.

** Quand j'utilise la commande =vagrant up=, je vois de nombreuses lignes "default: Warning: Connection timeout. Retrying..." ou "default: Warning: Remote connection disconnect. Retrying..."

Tout d'abord, ces lignes sont tout à fait normales si leur nombre est peu élevé et correspondent au temps de démarrage de la machine.

Si l'invite de commande en est rempli, il est conseillé d'interrompre
la commande (ctrl-C sur UNIX, XXX sur windows) et de recommencer
l'étape d'installation que vous faisiez.

** TODO Si le binding de port ne fonctionne pas, que faire (rerédiger en fonction du message d'erreur réel)

TBD

Le démarrage de la machine virtuelle effectue une redirection du port
80 du /guest/ vers le port 8080 de l'/hôte/. Il se peut qu'une telle
redirection soit interdite (firewall) ou impossible (une autre
application de l'hôte utilise déjà le port 8080).

Il est alors possible de modifier le fichier =Vagrantfile= (qui a été
généré dans le dossier de travail par =vagrant init=) pour utiliser un
autre port, par exemple 8081. Il faudra alors adapter toutes les URLs
pour utiliser à la place =http://localhost:8081=

** =vagrant ssh= échoue, sous Windows

En plus de l'installation de Vagrant et VirtualBox, il est nécessaire
d'installer un client SSH que Vagrant pourra utiliser pour se
connecter (avec une clé privée particulière) de façon transparente à
l'intérieur du /guest/.

Sur les systèmes Windows, il est probable qu'aucun client SSH ne sera
installé par défaut.

Ceci est une FAQ Vagrant, pour laquelle de nombreuses ressources
Internet sont disponibles. Contactez les forums du MOOC si vous n'y
arrivez pas par vous-même.

** Comment me connecter via SSH à la VM vagrant

Normalement, la commande =vagrant ssh= permet de faire cela de façon
transparente.

Sinon, n'importe quel client SSH fera l'affaire : se connecter avec
l'utilisateur =vagrant= et le mot-de-passe =vagrant= sur le port 2222
de l'/hôte/ (redirigé vers le port 22 du /guest/) : =ssh -p 2222 vagrant@localhost= (mot de passe : =vagrant=)


** TODO J'ai écrasé la base de données, que faire

** Si j'ai déjà un autre virtualiseur, puis-je convertir la VM ?

* TODOs                                                            :noexport:

** TODO Documenter la publication de la box

- box uploadée sur partage
- ajoutée dans vagrantcloud (référencée par son URL de download de partage)

** TODO Customiser phppgadmin pour utiliser le français par défaut plutôt que auto pour la langue de l'interface ?
dans /etc/phppgadmin/config.inc.php :
 $conf['default_lang'] = 'french';

** DONE Customization de la locale par défaut à français ?
CLOSED: [2014-08-11 lun. 11:14]
#+BEGIN_example
cat preseed.txt 
locales locales/locales_to_be_generated multiselect     en_US.UTF-8 UTF-8 fr_FR.UTF-8 UTF-8
locales locales/default_environment_locale      select  fr_FR.UTF-8
DEBIAN_FRONTEND=noninteractive DEBCONF_NONINTERACTIVE_SEEN=true dpkg-reconfigure locales
#+END_example

Pas nécessaire : géré par la construction de la box dans bootstrap-vz

** DONE Customization du miroir par défait sur ftp.fr.debian.org ?
CLOSED: [2014-08-07 jeu. 09:21]
#+BEGIN_example
deb http://ftp.fr.debian.org/debian jessie main contrib non-free 
deb-src http://ftp.fr.debian.org/debian jessie main contrib non-free 

deb http://security.debian.org/ jessie/updates main contrib non-free 
deb-src http://security.debian.org/ jessie/updates main contrib non-free 

# jessie-updates, previously known as 'volatile'
deb http://ftp.fr.debian.org/debian jessie-updates main contrib non-free 
deb-src http://ftp.fr.debian.org/debian jessie-updates main contrib non-free 
#+END_example

Idem: pas nécessaire : géré par bootstrap-vz dans le manifest .json

** DONE Customization du keymap
CLOSED: [2014-08-11 lun. 15:00]

#+BEGIN_example
# cat keymap-preseed.txt 
console-data	console-data/keymap/policy	select	Select keymap from arch list
console-data	console-data/keymap/family	select	azerty
console-data	console-data/keymap/azerty/layout	select	French
console-data	console-data/keymap/azerty/french/variant	select	With Euro (latin 9)


debconf-set-selections keymap-preseed.txt 
DEBIAN_FRONTEND=noninteractive DEBCONF_NONINTERACTIVE_SEEN=true dpkg-reconfigure console-data

# pas nécessaire :
# dpkg-reconfigure keyboard-configuration

service keyboard-setup restart
#+END_example

** DONE Faire une version GUI avec env de bureau complet ?
CLOSED: [2014-08-11 lun. 22:23]
peut-être juste une option de vagrant up ?

DONE : fait par ajout d'un script install-gui.sh - Cf. + haut

* À propos de la Box Vagrant du MOOC

