VagrantBox/manuel.html

<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">Comment installer un environnement de bureau sur la VM</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Normalement, vous n'aurez pas besoin d'utiliser la machine virtuelle en mode bureau graphique pour les TPs du MOOC, mais c'est cependant tout-à-fait faisable.
</p>

<p>
Nous fournissons un script de mise-à-jour permettant d'installer (en
mode superutilisateur Linux) l'environnement de bureau XFCE4,
préconfiguré en français avec clavier azerty : <code>/usr/local/sbin/install-gui.sh</code>.
</p>

<p>
Pour le lancer, rentrer la commande suivante :
</p>
<pre class="example">
vagrant ssh -c "sudo /usr/local/sbin/install-gui.sh"
</pre>

<p>
Attention, ceci fait augmenter substentiellement l'occupation disque de la machine virtuelle.
</p>
</div>
</div>

<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="todo TODO">TODO</span> Comment installer l'application exerciseur manuellement</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
Les sources sont disponibles depuis git avec : 
git clone <a href="http://fusionforge.int-evry.fr/anonscm/git/bdsqlwiz/bdsqlwiz.git">http://fusionforge.int-evry.fr/anonscm/git/bdsqlwiz/bdsqlwiz.git</a>
</p>

<p>
TBD : archive extractible .zip, dans
<a href="https://fusionforge.int-evry.fr/frs/?group_id=64">https://fusionforge.int-evry.fr/frs/?group_id=64</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> J'ai un système 32 bits, est-ce que ça marchera pour moi ?</h3>
<div class="outline-text-3" id="text-5-2">
<p>
La version canonique sur laquelle nous avons basé nos réalisations et
nos tests de VM est la version 64 bits (architecture Linux <code>amd64</code>), qui
nécessite un hôte 64 bits.
</p>

<p>
Nous mettons également à votre disposition une version 32 bits, mais ayant fait
l'objet de tests moins poussés. 
</p>

<p>
Pour l'utiliser, remplacer
<code>oberger/moocbdvm</code> par <b><code>oberger/moocbdvm32</code></b> dans les instructions
<code>vagrant init</code>.
</p>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Je n'ai pas accès à Internet en haut débit</h3>
<div class="outline-text-3" id="text-5-3">
<p>
C'est bien dommage (d'autant que visionner les vidéos du MOOC doit
être pénible, dans ce cas). Cependant, vous pouvez installer de façon
indépendantes, les applications que nous avons empaquetées dans la
<i>box</i>.
</p>

<p>
Notez tout d'abord qu'un environnement d'exerciseur est disponible
aussi pour les navigateurs basés sur Webkit (Chrome, Safari), sans
nécessiter l'installation d'un SGBD comme PostgreSQL. (Cf. XXX - TODO)
</p>

<p>
Autrement, pas besoin de machine virtuelle, si vous savez installer un
SGBD par vous-même. Si vous avez la possibilité de créer une base de
données PostgreSQL localement, les scripts de création de base sont
disponibles dans XXX TODO.
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Le message de confirmation de mise en place ne s'affiche pas.</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Reprendre les instuctions d'installation depuis le début en vérifiant que toutes les étapes ont été correctement suivies.
</p>

<p>
Il peut être nécessaire de mettre à jour la box (commandes <code>vagrant box outdated</code>, etc.). Veuillez vous reporter à la documentation Vagrant.
</p>

<p>
Si le problème persiste, contactez-nous via les forums du MOOC.
</p>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Quand j'utilise la commande <code>vagrant up</code>, je vois de nombreuses lignes "default: Warning: Connection timeout. Retrying&#x2026;" ou "default: Warning: Remote connection disconnect. Retrying&#x2026;"</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Tout d'abord, ces lignes sont tout à fait normales si leur nombre est peu élevé et correspondent au temps de démarrage de la machine.
</p>

<p>
Si l'invite de commande en est rempli, il est conseillé d'interrompre
la commande (ctrl-C sur UNIX, XXX sur windows) et de recommencer
l'étape d'installation que vous faisiez.
</p>
</div>
</div>

<div id="outline-container-sec-5-6" class="outline-3">
<h3 id="sec-5-6"><span class="section-number-3">5.6</span> <span class="todo TODO">TODO</span> Si le binding de port ne fonctionne pas, que faire (rerédiger en fonction du message d'erreur réel)</h3>
<div class="outline-text-3" id="text-5-6">
<p>
TBD
</p>

<p>
Le démarrage de la machine virtuelle effectue une redirection du port
80 du <i>guest</i> vers le port 8080 de l'<i>hôte</i>. Il se peut qu'une telle
redirection soit interdite (firewall) ou impossible (une autre
application de l'hôte utilise déjà le port 8080).
</p>

<p>
Il est alors possible de modifier le fichier <code>Vagrantfile</code> (qui a été
généré dans le dossier de travail par <code>vagrant init</code>) pour utiliser un
autre port, par exemple 8081. Il faudra alors adapter toutes les URLs
pour utiliser à la place <code>http://localhost:8081</code>
</p>
</div>
</div>

<div id="outline-container-sec-5-7" class="outline-3">
<h3 id="sec-5-7"><span class="section-number-3">5.7</span> <code>vagrant ssh</code> échoue, sous Windows</h3>
<div class="outline-text-3" id="text-5-7">
<p>
En plus de l'installation de Vagrant et VirtualBox, il est nécessaire
d'installer un client SSH que Vagrant pourra utiliser pour se
connecter (avec une clé privée particulière) de façon transparente à
l'intérieur du <i>guest</i>.
</p>

<p>
Sur les systèmes Windows, il est probable qu'aucun client SSH ne sera
installé par défaut.
</p>

<p>
Ceci est une FAQ Vagrant, pour laquelle de nombreuses ressources
Internet sont disponibles. Contactez les forums du MOOC si vous n'y
arrivez pas par vous-même.
</p>
</div>
</div>

<div id="outline-container-sec-5-8" class="outline-3">
<h3 id="sec-5-8"><span class="section-number-3">5.8</span> Comment me connecter via SSH à la VM vagrant</h3>
<div class="outline-text-3" id="text-5-8">
<p>
Normalement, la commande <code>vagrant ssh</code> permet de faire cela de façon
transparente.
</p>

<p>
Sinon, n'importe quel client SSH fera l'affaire : se connecter avec
l'utilisateur <code>vagrant</code> et le mot-de-passe <code>vagrant</code> sur le port 2222
de l'<i>hôte</i> (redirigé vers le port 22 du <i>guest</i>) : <code>ssh -p 2222 vagrant@localhost</code> (mot de passe : <code>vagrant</code>)
</p>
</div>
</div>


<div id="outline-container-sec-5-9" class="outline-3">
<h3 id="sec-5-9"><span class="section-number-3">5.9</span> <span class="todo TODO">TODO</span> J'ai écrasé la base de données, que faire</h3>
</div>

<div id="outline-container-sec-5-10" class="outline-3">
<h3 id="sec-5-10"><span class="section-number-3">5.10</span> Si j'ai déjà un autre virtualiseur, puis-je convertir la VM ?</h3>
</div>
</div>
